; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph3 - mode
	image2 - mode
	infrared0 - mode
	infrared1 - mode
	Star2 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation1 - direction
	Star4 - direction
	Star3 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 thermograph3)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 infrared1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared1)
	(supports instrument2 image2)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Star3)
	(pointing satellite1 Planet9)
	(have_image Phenomenon6 infrared1)
	(have_image Planet7 infrared0)
	(have_image Planet8 image2)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 image2)
))

)

; plan
1. (turn_to satellite2 star3 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 star3)
   goals met: 0 of 7
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 7
3. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 0 of 7
4. (turn_to satellite2 phenomenon6 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon6)
   goals met: 0 of 7
5. (turn_to satellite1 star0 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star0)
   goals met: 0 of 7
6. (turn_to satellite0 star3 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star3)
   goals met: 1 of 7
7. (take_image satellite2 phenomenon6 instrument4 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 2 of 7
8. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 2 of 7
9. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 2 of 7
10. (turn_to satellite1 phenomenon10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 7
11. (take_image satellite1 phenomenon10 instrument2 image2)
   added: (have_image phenomenon10 image2)
   goals met: 3 of 7
12. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 3 of 7
13. (take_image satellite1 planet8 instrument2 image2)
   added: (have_image planet8 image2)
   goals met: 4 of 7
14. (turn_to satellite1 planet9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet9)
   goals met: 5 of 7
15. (take_image satellite1 planet9 instrument2 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 6 of 7
16. (turn_to satellite2 planet7 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 planet7)
   goals met: 6 of 7
17. (take_image satellite2 planet7 instrument4 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 7 of 7
